# вычислить значение лгического выражения 

print("Введите значение x: ")

x = int(input())

print("Введите значение y:")

y = int(input())

print("1 логическое выражение: ", x**2 + x**2 <= 4)

print("2 логическое выражение: ",x**2 - x**2 <= 4)

print("3 логическое выражение: ",x >= 0 and y**2 != 4)

print("4 логическое выражение: ",x >= 0 and y**2 != 4)

print("6 логическое выражение: ",x*y != 0 or y >x )

print("7 логическое выражение: ",not(x * y < 0) or  y > x)

print("8 логическое выражение: ",not(x * y < 0) and y > x )

print("9 логическое выражение: ",x >= 4 and y**2 != 4 )

print("10 логическое выражение: ",x >= 4 and y**2 != 4 )