#вычислить подьезд и этаж на котором находиться квартира

print("Ваша задача ввести номер квартиры:")

n = int(input())

if n < 0:
    print("Клоун, номер квартиры не может быть отрицательным.")
else:
    a = 9 * 4 #квартир в одном подьезде
    if n % a == 0:#номер подьезда
        c = n // a
    elif n % a != 0:
        c = n // a + 1
    if (n - (c * 36)) % 4 == 0:
        i = i = (n - ((c-1) * 36)) // 4
    elif (n - (c * 36)) % 4 != 0:
        i = ((n - ((c-1) * 36)) // 4) + 1
    if c == 0:
        c = 1 
    if i == 0:
        i = 1
print("квартира находиться в ", c ,"подьезде", "на ", i , "этаже.")
