# работа со списками

# a)

k = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
l = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
i = len(k)
print("a) перывй список:",k, "\nВторой список:",l)

# b)
k.remove(10)
print("b) первый список без второго элемента:", k)

# c)

l.remove(100)
q = len(l)
l.insert(q, 200)
print("c) второй список с заменой последнего значения на 200:", l)

# d)

n = k + l
print("d) Обьединение двух списков.", n)

# e)

e = n[6:14]
print("e) Срез из двойного списка:", e)

# f)

e.append(23)
e.append(45)
print("f) список срез с двумя новыми переменными:", e)

# g)

print("g) Минимум обьединенного списка:", min(n))
print("Максимум обьединенного списка:", max(n))