# рачитываем кол-во не чётных числе на заданном отрезке

print("Ваша задача будет ввести начало и конец промежутка(чётные)).")

l = 0

nechetnie = []

n = int(input("Введите начло промежка:"))
m = int(input("Введите конец промежутка:"))

if n % 2 != 0 and n % 2 != 0:
    print("Задание читай клоун.")
else:
    while n != m:
        if n % 2 == 0:
            k = 0
            n += 1 
        elif n % 2 != 0:
            k = n 
            n += 1
            nechetnie.append(k) 
            l += 1
        
print(nechetnie)

print("В данном промежутке", l , "нечётных чисел.")


