# определяем треугольник

print("Введите длинну первой стороны:")

a = int(input())

print("Введите длину второй стороны:")

b = int(input())

print("Введите динну третьей стороны:")

c = int(input())

if a == b == c:
    print("Треугольник равносторонний.")
elif a == b or a == c or b == c:
    print("треугольник равнобедренный.")
elif a**2 + b**2 == c**2:
    print("Треугольный прямоугольный.")
elif a >= b + c or b >= a + c or c >= a + b:
    print("Такого треугольника не существует")
elif a != b and a != b and c != b:
    print("Треугольник разносторонний.")