# работа со словарями

# a)

School = {'1a':25, '1b': 21, '1c':23, '1d': 24,  '2a':21, '2b':22, '2c':25, '2d':23}

print("a) Все классы в данной школе:", School)

# b) 

print("b) Введите номер и букв класса(на английском):")
i = input()
if i in School:
    print("В данном класе:",School[i], "учеников.")
else:
    print("Такого класса не существует.")

# c)

School['1a'] = 27
School['1d'] = 30
School['1c'] = 21

print("c) В некоторых класса произошли изменениния вот новый список:", School)

# d)

School['3a'] = 24
School['3b'] = 32

print("d) Появилось два новых классах вот новый список:", School)

# e)

del School['1b']
del School['2c']

print("e) Было расформировано два класса вот оставшиеся:", School)
