# запись условий для истинности

print("Введите значение X: ")

x = int(input())

print("введите значение Y: ")

y = int(input())

print("введите значение Z: ")

z = int(input())

# 1 условие

print("Ответ на 1 условие:", (x // 13 and x < 100))

# 2 условие

print("Ответ на 2 услоыие:", (x > 10 and x < 20))

# 3 условие

print("Ответ на 3 условие:", (x > 25 and y > 25))

# 4 условие 

print("Ответ на 4 условие:", (x % 2 != 0 and y % 2 != 0))

# 5 условие

print("Ответ на 5 условие:", (x % 2 == 0 or y % 2 == 0))

# 6 условие

print("Ответ на 6 условие:", (x > 0 or y > 0))

# 7 условие

print("ответ на 7 условие:", (x % 5 == 0 and y % 5 == 0 and z % 5 == 0))

# 8 условие

print("Ответ на 8 условие:", (x % 3 == 0 or y % 3 == 0 or z % 3 == 0))

# 9 условие

print("Ответ на 9 условие:", (x < 10 or y < 10 or z < 10))

# 10 условие

print("Ответ на 10 условие:", x < 0 or y < 0 or z < 0)
